package lesson6;

/**
 * Created by ddimmxxgmail.com on 2/19/17.
 *
 * ПОЛИМОРФИЗМ
 *
 * представляет собой концепцию предпологающей исп единого имени иден при обращении к обьектам
 * нескольких раных классов при условии что ини являются все обьктами одного суперкласса.
 *
 * Абстрактыный класс - на основе которого не могут создаваться обьекты, при этом наследники класса могут быть
 * не абстрактными и на их основе можно создавать обьекты.
 *
 *
 * ИНТЕФЕЙС
 * синтаксическая конструкция в коде программы используемая для специфирования услуг предоставляемых классом
 * или компонентом
 *
 */



public class lesson6 {
}
